[
    {
        "name": "HackX Startup Challenge 2019",
        "img": "data/hackx/gallery/teleport_devices1.jpg",
        "place": "Winners",
        "date": "Sept 2019",
        "organizer": "University of Kelaniya - MIT",
        "detail": "HackX is a hackathon-like competition, which was held throughout a month. We as team ‘pulse’ implemented a product idea, which is a ride-sharing platform for delivery. 150+ teams participated, and we were able to place the 1st"
    },
    {
        "name": "IESL Robo Games 2018",
        "img": "data/robotgames/gallery/grp1.jpg",
        "place": "Winners",
        "date": "Oct 2018",
        "organizer": "Institute of Engineers Sri Lanka",
        "detail": "Robogames is an annual robotics competition held in the annual exhibition ‘Techno’ at BMICH. In this competition, the task was to make a 4-legged robot, which can follow lines while reading road signs with the direction of turns and turn respectively. This was my first ever competition as an undergraduate and we were able to become winners."
    },
    {
        "name": "XO-Bot Robot Competition 2019",
        "img": "data/xobot/gallery/play.jpg",
        "place": "Runners Up",
        "date": "Oct 2019",
        "organizer": "Institute of Engineers Sri Lanka",
        "detail": "This competition was held in Techno 2019 at BMICH. The competition was to develop a robot which can do the Tic-Tac-Toe game (2 robots of 2 teams playing with each other. Balls of 2 colors are there and a robot has to line up 3 balls of its color. If the game was a tie, the fastest robot wins.) We were able to place the 2nd in that competition."
    },
    {
        "name": "RealHack Hackathon 2019 ",
        "img": "data/realhack/gallery/selfie1.jpg",
        "place": "Runners Up",
        "date": "Nov 2019",
        "organizer": "University of Kelaniya",
        "detail": "RealHack was a 24-hour hackathon, which the participant teams were given a problem to solve with a software solution. We developed a mobile application, which is a platform where anyone can ask questions and give answers. We were able to place the 2nd."
    }
]